---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath3d
source: html/b0f6cd16-abe3-f678-95c4-73919685b3cf.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsDbgShowRunPath3d Property

"Show Run's Path 3D"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsDbgShowRunPath3d { get; }
```